--- a/_present/Present-Architecture.md
+++ b/_present/Present-Architecture.md
@@ -9,126 +9,91 @@ collection: present
 ## Present Sequence Diagrams
 
 ### Upload Template Flow
-```plantuml
-@startuml upload template
-scale max 670 width
-title Upload template
-actor "Present Admin" as A
-participant "Salesforce" as S
-participant "APIM" as APIM
-participant "Present Backend" as P
-participant "Blob Storage" as B
 
-A -> S: Upload template (LWC)
-S -> S: Upload template\nto SF user library
-S -> APIM: Get token\nvia named credentials
-APIM -> S: Token response
-S -> P: Upload(ContentVersionId and OwnerId)
-P -> S: Get ContentVersion content
-S -> P: ContentVersion content
-P -> B: Create new blob
-B -> P: Blob created
-P -> S: Template uploaded response
-S -> A: List templates (LWC)
-@enduml
+```mermaid
+sequenceDiagram
+    autonumber
+    actor A as Present Admin
+    participant S as Salesforce
+    participant APIM as APIM
+    participant P as Present Backend
+    participant B as Blob Storage
+
+    A ->> S: Upload template (LWC)
+    S ->> S: Upload template to SF user library
+    S ->> APIM: Get token via named credentials
+    APIM ->> S: Token response
+    S ->> P: Upload(ContentVersionId and OwnerId)
+    P ->> S: Get ContentVersion content
+    S ->> P: ContentVersion content
+    P ->> B: Create new blob
+    B ->> P: Blob created
+    P ->> S: Template uploaded response
+    S ->> A: List templates (LWC)
 ```
 
 ### Generate Presentation Flow
-```plantuml
